#ifndef CDIALOG_USER_SETTINGS_H
#define CDIALOG_USER_SETTINGS_H

//====================================================================================================
//описание
//====================================================================================================

//Класс диалога настройки пользователя

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "cdocument_main.h"

//====================================================================================================
//класс диалога настройки пользователя
//====================================================================================================
class CDialog_UserSettings:public CDialog
{
 protected:
  //-Переменные класса-------------------------------------------------------
  SUser sUser_Local;//редактируемый пользователь
 public:
  //-Конструктор класса------------------------------------------------------
  CDialog_UserSettings(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-Деструктор класса-------------------------------------------------------
  ~CDialog_UserSettings();
  //-Функции-----------------------------------------------------------------
  afx_msg void OnOK(void);//нажали Enter
  afx_msg void OnCancel(void);//нажали ESC
  afx_msg BOOL OnInitDialog(void);//инициализация диалога
  //-Функции класса----------------------------------------------------------
  bool Activate(SUser& sUser);//запустить диалог
  //-Функции обработки сообщений класса--------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//уничтожение окна
  afx_msg void OnCommand_Button_Ok(void);//применить настройки
  afx_msg void OnCommand_Button_Cancel(void);//отменить настройки
 protected:
  //-Новые функции класса (защищённые)---------------------------------------
  //-Прочее------------------------------------------------------------------  
};
//---------------------------------------------------------------------------
#endif