#ifndef CFRAMEWND_MAIN_H
#define CFRAMEWND_MAIN_H
//====================================================================================================
//описание
//====================================================================================================

//Класс рамки окна

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "cdocument_main.h"

//====================================================================================================
//класс рамки окна
//====================================================================================================
class CFrameWnd_Main:public CFrameWnd
{
 protected:
  //-Переменные класса-------------------------------------------------------
  NOTIFYICONDATA NotifyIconData;//иконка
  HICON hIcon_SysTray;//иконка в трее
  unsigned long PingCounter;//счётчик для посылки сообщений для проверки связи
 public:
  //конструктор
  CFrameWnd_Main(void);
  //деструктор
  ~CFrameWnd_Main();
  //Функции класса----------------------------------------------------------
  afx_msg int OnCreate(LPCREATESTRUCT lpCreateStruct);//создание рамки
  afx_msg void OnTimer(UINT nIDEvent);//событие таймера
  afx_msg void OnDestroy(void);//уничтожение рамки
  afx_msg void OnSysCommand(UINT nID,LPARAM lParam);//изменение параметров окна
  //-Функции обработки сообщений класса--------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnSystemTrayIconMessage(WPARAM wParam,LPARAM lParam);//обработка сообщений трея
  afx_msg void OnCommand_Menu_SysTray_Exit(void);//обработка команды выхода из программы
  //-Прочее------------------------------------------------------------------
  DECLARE_DYNCREATE(CFrameWnd_Main) 
};
#endif