#ifndef CIPROJECTDATABASE_ENGINE_H
#define CIPROJECTDATABASE_ENGINE_H

//====================================================================================================
//описание
//====================================================================================================

//Абстрактный класс работы с базой данных проектов

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <list>
#include "stdafx.h"
#include "craiicdatabase.h"
#include "craiicrecordset.h"
#include "crecordset_projectlist.h"



//====================================================================================================
//структуры
//====================================================================================================

//====================================================================================================
//абстрактный класс работы с базой данных проектов
//====================================================================================================

class CIProjectDatabaseEngine
{
 public:
  //-Деструктор класса-------------------------------------------------------
  virtual ~CIProjectDatabaseEngine() {};
  //-Функции класса----------------------------------------------------------
  virtual bool FindProjectByGUID(const CSafeString &guid,CProject &cProject)=0;//найти проект по GUID
  virtual std::list<CProject> GetAllProject(void)=0;//получить все проекты
  virtual bool AddProject(CProject &cProject)=0;//добавить проект
  virtual bool DeleteProject(const CProject &cProject)=0;//удалить проект
  virtual bool ChangeProject(const CProject &cProject)=0;//изменить проект
  virtual void ResetBase(void)=0;//очистить базу
};

#endif