#ifndef CITASKDATABASE_ENGINE_H
#define CITASKDATABASE_ENGINE_H

//====================================================================================================
//описание
//====================================================================================================

//Абстрактный класс работы с базой данных заданий

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <list>
#include <CString>
#include "stdafx.h"
#include "craiicdatabase.h"
#include "crecordset_tasklist.h"

using namespace std;

//====================================================================================================
//структуры
//====================================================================================================

//====================================================================================================
//абстрактный класс работы с базой данных заданий
//====================================================================================================

class CITaskDatabaseEngine
{
 public:
  //-Деструктор класса-------------------------------------------------------
  virtual ~CITaskDatabaseEngine() {};
  //-Функции класса----------------------------------------------------------
  virtual bool FindTaskByGUID(const CString &guid,STask &sTask)=0;//найти задание по GUID
  virtual list<STask> GetAllTaskForUserGUID(const CString &guid)=0;//получить все задания для и от пользователя с заданным GUID
  virtual list<STask> GetAllTask(void)=0;//получить все задания
  virtual bool AddTask(STask &sTask)=0;//добавить задание
  virtual bool DeleteTask(const STask &sTask)=0;//удалить задание
  virtual bool ChangeTask(const STask &sTask,bool &for_user_change,STask &sTask_Deleted,STask &sTask_Added)=0;//изменить задание
  virtual void ResetBase(void)=0;//очистить базу
};

#endif