#ifndef CIUSERDATABASE_ENGINE_H
#define CIUSERDATABASE_ENGINE_H

//====================================================================================================
//описание
//====================================================================================================

//Абстрактный класс работы с базой данных пользователей

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <list>
#include <CString>
#include "stdafx.h"
#include "craiicdatabase.h"
#include "crecordset_userlist.h"

using namespace std;

//====================================================================================================
//структуры
//====================================================================================================

//====================================================================================================
//абстрактный класс работы с базой данных пользователей
//====================================================================================================

class CIUserDatabaseEngine
{
 public:
  //-Деструктор класса-------------------------------------------------------
  virtual ~CIUserDatabaseEngine() {};
  //-Функции класса----------------------------------------------------------
  virtual bool AddUser(SUser& sUser)=0;//добавить пользователя
  virtual bool ChangeUser(long index,const SUser& sUser)=0;//задать пользователя
  virtual bool GetUser(long index,SUser &sUser)=0;//получить пользователя по индексу
  virtual bool DeleteUser(long index)=0;//удалить пользователя по индексу
  virtual list<SUser> GetAllUser(void)=0;//получить список всех пользователей
  virtual bool FindUserByLoginAndPassword(const CString& login,const CString& password,SUser& sUser)=0;//найти пользователя по логину и паролю
  virtual bool FindUserByGUID(const CString& guid,SUser& sUser)=0;//найти пользователя по GUID
};

#endif