#ifndef CPROJECT_H
#define CPROJECT_H

//====================================================================================================
//описание
//====================================================================================================

//Класс пользователя

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "csafestring.h"

//====================================================================================================
//класс пользователя
//====================================================================================================
class CProject
{
 private:
  CSafeString ProjectName;//название проекта
  CSafeString ProjectGUID;//уникальный идентификатор  
  //-Переменные класса-------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CProject(void);
  //-Деструктор класса-------------------------------------------------------
  ~CProject();
  //-Функции класса----------------------------------------------------------
  const CSafeString& GetProjectName(void) const;//получить название
  const CSafeString& GetProjectGUID(void) const;//получить уникальный идентификатор

  void SetProjectName(const char *project_name);//задать название
  void SetProjectGUID(const char *guid);//задать уникальный идентификатор

  bool IsProjectGUID(const char *guid);//верный ли ProjectGUID
};
#endif
