#ifndef CPROJECTDATABASE_ENGINE_SOFTWARE_H
#define CPROJECTDATABASE_ENGINE_SOFTWARE_H

//====================================================================================================
//описание
//====================================================================================================

//Класс работы с базой данных проектов с использованием программного механизма поиска записей

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "ciprojectdatabaseengine.h"

using namespace std;

//====================================================================================================
//структуры
//====================================================================================================

//====================================================================================================
//класс работы с базой данных проектов с использованием программного механизма поиска записей
//====================================================================================================

class CProjectDatabaseEngine_Software:public CIProjectDatabaseEngine
{
 protected:
  //-Переменные класса-------------------------------------------------------
  CString ProjectListTableName;//имя таблицы базы данных списка проектов  
  CString ProjectListBaseInitString;//строка инициализации базы данных проектов
  CDatabase cDatabase_ProjectList;//база данных списка проектов
 public:
  //-Конструктор класса------------------------------------------------------
  CProjectDatabaseEngine_Software(const CString &project_list_table_name);
  //-Деструктор класса-------------------------------------------------------
  ~CProjectDatabaseEngine_Software();
  //-Функции класса----------------------------------------------------------
  bool FindProjectByGUID(const CSafeString &guid,CProject &cProject) override;//найти проект по GUID
  list<CProject> GetAllProject(void) override;//получить все проекты
  bool AddProject(CProject &cProject) override;//добавить проект
  bool DeleteProject(const CProject &cProject) override;//удалить проект
  bool ChangeProject(const CProject &cProject) override;//изменить проект
  void ResetBase(void) override;//очистить базу
};

#endif