#ifndef CPROJECTDATABASE_ENGINE_SOFTWARE_H
#define CPROJECTDATABASE_ENGINE_SOFTWARE_H

//====================================================================================================
//описание
//====================================================================================================

//Класс работы с базой данных проектов с использованием программного механизма поиска записей

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "ciprojectdatabaseengine.h"

using namespace std;

//====================================================================================================
//структуры
//====================================================================================================

//====================================================================================================
//класс работы с базой данных проектов с использованием программного механизма поиска записей
//====================================================================================================

class CProjectDatabaseEngine_Software:public CIProjectDatabaseEngine
{
 protected:
  //-Переменные класса-------------------------------------------------------
  CString ProjectListTableName;//имя таблицы базы данных списка проектов  
  CString ProjectListBaseInitString;//строка инициализации базы данных проектов
  CDatabase cDatabase_ProjectList;//база данных списка проектов
 public:
  //-Конструктор класса------------------------------------------------------
  CProjectDatabaseEngine_Software(const CString &project_list_table_name);
  //-Деструктор класса-------------------------------------------------------
  ~CProjectDatabaseEngine_Software();
  //-Функции класса----------------------------------------------------------
  bool FindProjectByGUID(const CString &guid,SProject &sProject);//найти проект по GUID
  list<SProject> GetAllProject(void);//получить все проекты
  bool AddProject(SProject &sProject);//добавить проект
  bool DeleteProject(const SProject &sProject);//удалить проект
  bool ChangeProject(const SProject &sProject);//изменить проект
  void ResetBase(void);//очистить базу
};

#endif