#ifndef CRECORDSET_USERLIST_H
#define CRECORDSET_USERLIST_H

//====================================================================================================
//описание
//====================================================================================================

//Класс записи информации о пользователях

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include "cuser.h"
#include <string>

using namespace std;

//====================================================================================================
//класс записи данных пользователя
//====================================================================================================
class CRecordset_UserList:public CRecordset
{
 protected:
  //-Переменные класса-------------------------------------------------------
  CString Name;//имя
  CString JobTitle;//должность
  CString Login;//логин
  CString Password;//пароль
  CString Description;//описание
  CString Telephone;//телефон
  CString UserGUID;//идентификатор
  int Leader;//является ли лидером
 public:
  //-Конструктор класса------------------------------------------------------
  CRecordset_UserList(CDatabase* pDatabase=NULL);
  //-Деструктор класса-------------------------------------------------------
  ~CRecordset_UserList();
  //-Функции класса----------------------------------------------------------
  void SetRecord(const CUser& cUser);//задать запись
  void GetRecord(CUser& cUser);//получить запись
  virtual CString GetDefaultConnect(void);
  virtual CString GetDefaultSQL(void);
  virtual void DoFieldExchange(CFieldExchange* pFX);
};
#endif