#ifndef CTASKDATABASE_ENGINE_SOFTWARE_H
#define CTASKDATABASE_ENGINE_SOFTWARE_H

//====================================================================================================
//описание
//====================================================================================================

//Класс работы с баой данных заданий с использованием программного механизма поиска записей

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "citaskdatabaseengine.h"

using namespace std;

//====================================================================================================
//структуры
//====================================================================================================

//====================================================================================================
//класс работы с базой данных заданий с использованием программного механизма поиска записей
//====================================================================================================

class CTaskDatabaseEngine_Software:public CITaskDatabaseEngine
{
 protected:
  //-Переменные класса-------------------------------------------------------
  CString TaskListTableName;//имя таблицы базы данных списка задач  
  CString TaskListBaseInitString;//строка инициализации базы данных заданий
  CDatabase cDatabase_TaskList;//база данных списка задач
 public:
  //-Конструктор класса------------------------------------------------------
  CTaskDatabaseEngine_Software(const CString &task_list_table_name);
  //-Деструктор класса-------------------------------------------------------
  ~CTaskDatabaseEngine_Software();
  //-Функции класса----------------------------------------------------------
  bool FindTaskByGUID(const CString &guid,STask &sTask);//найти задание по GUID
  list<STask> GetAllTaskForUserGUID(const CString &guid);//получить все задания для и от пользователя с заданным GUID
  list<STask> GetAllTask(void);//получить все задания
  bool AddTask(STask &sTask);//добавить задание
  bool DeleteTask(const STask &sTask);//удалить задание
  bool ChangeTask(const STask &sTask,bool &for_user_change,STask &sTask_Deleted,STask &sTask_Added);//изменить задание
};

#endif