#ifndef CTASK_EXPORT_HTML_H
#define CTASK_EXPORT_HTML_H

//====================================================================================================
//описание
//====================================================================================================

//Класс экспорта заданий в html

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "citaskexport.h"

//====================================================================================================
//класс экспорта заданий в html
//====================================================================================================

class CTaskExportHTML:public CITaskExport
{
 public:
  //конструктор
  CTaskExportHTML(void);
  //деструктор
  ~CTaskExportHTML();
  //-Функции класса----------------------------------------------------------
  bool Export(const CString &file_name,list<CTask> &list_CTask,list<CUser> &list_CUser);//экспортировать задания
};

#endif
