#ifndef CTASK_EXPORT_TXT_H
#define CTASK_EXPORT_TXT_H

//====================================================================================================
//описание
//====================================================================================================

//Класс экспорта заданий в txt

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "citaskexport.h"

//====================================================================================================
//класс экспорта заданий в txt
//====================================================================================================

class CTaskExportTXT:public CITaskExport
{
 public:
  //конструктор
  CTaskExportTXT(void);
  //деструктор
  ~CTaskExportTXT();
  //-Функции класса----------------------------------------------------------
  bool Export(const CString &file_name,const std::list<CTask> &list_CTask,const std::list<CUser> &list_CUser,const std::list<CProject> &list_CProject) override;//экспортировать задания
};

#endif
