#ifndef CTASK_EXPORT_CSV_H
#define CTASK_EXPORT_CSV_H

//====================================================================================================
//описание
//====================================================================================================

//Класс экспорта заданий в CSV

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "citaskexport.h"

//====================================================================================================
//класс экспорта заданий в CSV
//====================================================================================================

class CTaskExportCSV:public CITaskExport
{
 public:
  //конструктор
  CTaskExportCSV(void);
  //деструктор
  ~CTaskExportCSV();
  //-Функции класса----------------------------------------------------------
  bool Export(const CString &file_name,const std::list<CTask> &list_CTask,const std::list<CUser> &list_CUser,const std::list<CProject> &list_CProject) override;//экспортировать задания
};

#endif
