#ifndef CTRANSCEIVER_PING_H
#define CTRANSCEIVER_PING_H

//====================================================================================================
//описание
//====================================================================================================

//Класс приёмо-передатчика данных сообщения для проверки связи

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include <list>
#include <vector>
#include <string>
#include "cdocument_main.h"
#include "protocol.h"
#include "ctransceiver.h"



//====================================================================================================
//класс приёмо-передатчика данных сообщения для проверки связи
//====================================================================================================

class CTransceiver_Ping:public CTransceiver
{
 protected:
 public:  
  //конструктор
  CTransceiver_Ping(void);
  //деструктор
  ~CTransceiver_Ping();
  //функции класса
  void SendPingDataToClientInPackage(const SClient &sClient,SERVER_ANSWER answer,SERVER_COMMAND command,CEvent &cEvent_Exit,bool &on_exit);//передать клиенту сообщение для проверки связи
};

#endif
