#ifndef CUSERDATABASE_ENGINE_SOFTWARE_H
#define CUSERDATABASE_ENGINE_SOFTWARE_H

//====================================================================================================
//описание
//====================================================================================================

//Класс работы с базой данных пользователей с использованием программного механизма поиска записей

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "ciuserdatabaseengine.h"

using namespace std;

//====================================================================================================
//структуры
//====================================================================================================

//====================================================================================================
//класс работы с базой данных пользователей с использованием программного механизма поиска записей
//====================================================================================================

class CUserDatabaseEngine_Software:public CIUserDatabaseEngine
{
 protected:
  //-Переменные класса-------------------------------------------------------
  CString UserListTableName;//имя таблицы базы данных списка пользователей

  CString UserListBaseInitString;//строка инициализации базы данных пользователей

  CDatabase cDatabase_UserList;//база данных списка пользователей
 public:
  //-Конструктор класса------------------------------------------------------
  CUserDatabaseEngine_Software(const CString &user_list_table_name);
  //-Деструктор класса-------------------------------------------------------
  ~CUserDatabaseEngine_Software();
  //-Функции класса----------------------------------------------------------
  bool AddUser(SUser& sUser);//добавить пользователя
  bool ChangeUser(long index,const SUser& sUser);//задать пользователя
  bool GetUser(long index,SUser &sUser);//получить пользователя по индексу
  bool DeleteUser(long index);//удалить пользователя по индексу
  list<SUser> GetAllUser(void);//получить список всех пользователей
  bool FindUserByLoginAndPassword(const CString& login,const CString& password,SUser& sUser);//найти пользователя по логину и паролю
  bool FindUserByGUID(const CString& guid,SUser& sUser);//найти пользователя по GUID
};

#endif